package com.kosmo.ex;

public class S18JavaCopile {
    /*
---

### \[문제 1]

자바 컴파일 과정에서 `.java` 파일이 `.class` 파일로 변환되는 과정에서 컴파일러의 역할은 무엇인가?

---

### \[문제 2]

자바의 클래스 파일이 컴파일될 때, 하나의 `.java` 파일에 여러 개의 클래스가 선언되어 있다면 컴파일 결과로 어떤 일이 발생하는가?

---

### \[문제 3]

다음 중 자바 소스 파일의 이름과 클래스 이름이 반드시 같아야 하는 경우는?

A. 모든 클래스
B. public 클래스가 포함된 경우
C. 내부 클래스가 포함된 경우
D. 추상 클래스가 포함된 경우

---

### \[문제 4]

`public class MainApp`이라는 클래스가 있을 때, 올바른 파일 이름은 무엇이어야 하는가(컴파일전)?

A. MainApp.class
B. MainApp.java
C. mainapp.java
D. app.java

---

### \[문제 5]

다음 설명 중 잘못된 것을 모두 고르시오.

1. 자바는 인터프리터 언어이기 때문에 컴파일 과정이 없다.
2. `.class` 파일은 운영체제에서 바로 실행된다.
3. 자바는 플랫폼 독립성을 지원한다.
4. 자바의 `main()` 메서드는 객체가 생성되어야만 호출된다.

---

### \[문제 6]

`main()` 메서드가 반드시 가져야 하는 시그니처를 정확히 작성하시오.

---

### \[문제 7]

서로 다른 패키지에 정의된 클래스를 사용하려면 충족되어야 할 조건을 서술하시오.

---

### \[문제 8]

아래 코드에서 컴파일 에러가 발생하는 이유를 설명하시오.
// File: Car.java
class Hello {}

public class Car {}


// File: Test.java
class Hello {}

public class Test {}
```

---

### \[문제 9]

자바에서 클래스 이름이 중복되었을 때 발생할 수 있는 문제와 이를 방지하기 위한 방법은 무엇인가?

---

### \[문제 10]

자바 애플리케이션은 기본적으로 단일 스레드로 실행된다. 이와 관련하여 `main()` 메서드가 실행될 때의 흐름을 간단히 설명하시오.

---

*/
}
